src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыЗаказчиков</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ФинансовыеДанные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыЗаказчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМатериала</name>
      <type>
        <types>EnumRef.СостояниеМатериаловКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Использован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Реализация/ManagerModule.bsl
// Модуль менеджера документа "Реализация".
// Содержит процедуру формирования печатной формы "Акт выполненных работ".

#Область ПрограммныйИнтерфейс

// Печатная форма "Акт выполненных работ"
// Параметры:
//   ТабДок  - ТабличныйДокумент - в который выводится готовая печатная форма.
//   Ссылка  - ДокументСсылка.Реализация - Массив ссылок - документы для печати.
// Описание:
//   На основе макета "АктВыполненыхРабот" и запроса, получающего данные документа,
//   формируется готовая печатная форма с выводом товаров, услуг и материалов заказчика.
//   Для каждой ссылки (документа) выводится отдельный блок с заголовком, шапкой,
//   табличными частями и подвалом. Документы разделяются горизонтальной линией.
Процедура АктВыполненыхРабот(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(АктВыполненыхРабот)
	Макет = ПолучитьМакет("АктВыполненыхРабот"); // исправлено: убрано Документы.Реализация.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Автомобиль КАК Автомобиль,
	|	Реализация.ДокументОснование КАК ДокументОснование,
	|	Реализация.Контрагент КАК Контрагент,
	|	Реализация.Ответственный КАК Ответственный,
	|	Реализация.Склад КАК Склад,
	|	Реализация.Сотрудник КАК Сотрудник,
	|	Реализация.СуммаДокумента КАК СуммаДокумента,
	|	Реализация.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	Реализация.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги,
	|	Реализация.МатериалыЗаказчика.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		СостояниеМатериала КАК СостояниеМатериала,
	|		Использован КАК Использован
	|	) КАК МатериалыЗаказчика,
	|	Реализация.Номер КАК Номер,
	|	Реализация.Дата КАК Дата
	|ИЗ
	|	Документ.Реализация КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Инициализация областей макета.
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьМатериалыЗаказчикаШапка = Макет.ПолучитьОбласть("МатериалыЗаказчикаШапка");
	ОбластьМатериалыЗаказчика = Макет.ПолучитьОбласть("МатериалыЗаказчика");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	 // Очистка табличного документа перед заполнением.
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// Заголовок с номером и датой.
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD.MM.YYYY");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		// Шапка документа (основные реквизиты).
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		// Табличная часть "Товары"
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если ВыборкаТовары.Количество() > 0 Тогда
			ТабДок.Вывести(ОбластьТоварыШапка);
			ВыборкаТовары.Сбросить();
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		// Табличная часть "Услуги"
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Если ВыборкаУслуги.Количество() > 0 Тогда 
			// Выводим шапку таблицы товаров.
			ТабДок.Вывести(ОбластьУслугиШапка);
			// Сброс и повторный обход выборки после получения количества.
			ВыборкаУслуги.Сбросить();
			Пока ВыборкаУслуги.Следующий() Цикл
				ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
				ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		// Табличная часть "Материалы заказчика"
		ВыборкаМатериалыЗаказчика = Выборка.МатериалыЗаказчика.Выбрать();
		Если ВыборкаМатериалыЗаказчика.Количество() > 0 Тогда
			ТабДок.Вывести(ОбластьМатериалыЗаказчикаШапка);
			ВыборкаМатериалыЗаказчика.Сбросить();
			Пока ВыборкаМатериалыЗаказчика.Следующий() Цикл
				ОбластьМатериалыЗаказчика.Параметры.Заполнить(ВыборкаМатериалыЗаказчика);
				ТабДок.Вывести(ОбластьМатериалыЗаказчика, ВыборкаМатериалыЗаказчика.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		// Подвал с итоговой суммой и расшифровкой прописью.
		Подвал.Параметры.Заполнить(Выборка);
		СуммаДокумента = Выборка.СуммаДокумента;
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
		Подвал.Параметры.СуммаПрописью = ЧислоПрописью(СуммаДокумента, ФормСтрока, ПарПредмета);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

#КонецОбласти
